

vowels = ['a', 'e', 'i', 'o', 'u']
consonants = ['b', 'c', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'p', 'q', 'r', 's', 't', 'v', 'w', 'x', 'y', 'z']
# 'm' and 'n' are special characters as their individual presence inside
# the word creates a 'am' sound.
specials = ['m', 'n']


vowels_mapping = {
    'a': ('అ', 'ఆ'),
    'aa': ('ఆ'),
    'i': ('ఇ', 'ఈ'),
    'ee': ('ఈ'),
    'u': ('ఉ', 'ఊ'),
    'oo': ('ఊ'),
    'e': ('ఎ', 'ఏ'),
    'ai': ('ఐ'),
    'o': ('ఒ', 'ఓ'),
    'ou': ('ఔ'),
    'n': ('ం'),
    'm': ('ం')
    }
consonants_mapping = {
    'k': ('క'),
    'kh': ('ఖ'),
    'g': ('గ'),
    'gh': ('ఘ'),
    'ch': ('చ', 'ఛ'),
    'j': ('జ', 'ఝ'),
    'z': ('జ', 'ఝ'),
    't': ('ట', 'త', 'ఠ'),
    'd': ('డ', 'ద', 'ఢ'),
    'th': ('త', 'థ', 'ట'),
    'dh': ('ద', 'ధ'),
    'n': ('న', 'ణ'),
    'p': ('ప'),
    'ph': ('ఫ'),
    'f': ('ఫ'),
    'b': ('బ', 'భ'),
    'bh': ('భ', 'బ'),
    'm': ('మ'),
    'y': ('య'),
    'r': ('ర', 'ఱ'),
    'l': ('ల', 'ళ'),
    'v': ('వ'),
    'w': ('వ'),
    's': ('స', 'శ'),
    'sh': ('ష'),
    'h': ('హ')
}

sounds_mapping = {
    'a': ('',),
    'aa': ('ా'),
    'i': ('ి', 'ీ'),
    'ii': ('ీ'),
    'ee': ('ీ'),
    'u': ('ు', 'ూ'),
    'oo': ('ూ'),
    'e': ('ె', 'ే'),
    'ai': ('ై'),
    'o': ('ొ', 'ో'),
    'ou': ('ౌ'),
    'n': ('ం'),
    'm': ('ం')
}

silent = '్'
